{
  "content": "Dilipkumar J\nFrontend Developer\nMarakkanam - 604 303 | dkdhilip777@gmail.com | +91 6379889634 | GitHub | LinkedIn\nSUMMARY\nFrontend Developer skilled in building responsive, high-performance web applications using React, TypeScript, and\nmodern CSS frameworks like Tailwind. Experienced in state management, API integration, and clean component\narchitecture. Passionate about delivering intuitive UI/UX experiences and exploring AI-driven interfaces that enhance\nuser interactivity and accessibility.\nEDUCATION\nBachelor of Engineering, Electronics and Communication Engineering2021–2025\nAdhiparasakthi Engineering College, Melmaruvathur 82%\nHigher Secondary Certificate (HSC)2020–2021\nGovernment Higher Secondary School, Marakkanam 82.42%\nSecondary School Leaving Certificate (SSLC)2018–2019\nGovernment Higher Secondary School, Marakkanam 78.2%\nEXPERIENCE\nFrontend Developer Intern, Data Reveal AI Company Mar 2025 – Oct 2025\n• Developed responsive and performant frontend applications using React (Vite) and Tailwind CSS, enhancing UI/UX\nconsistency and load speed.\n• Built a Retrieval-Augmented Generation (RAG) chatbot for agricultural learning, integrating ChromaDB with Hug-\nging Face, LLMs for contextual accuracy.\n• Applied hands-on expertise in RAG and LLMs, while integrating AI capabilities into modern frontend applications.\nPROJECTS\nAgriLearn - React, TypeScript, Tailwind CSS, Python, vite\n• Engineered an AI-powered agricultural chatbot using Retrieval-Augmented Generation (RAG) to provide accurate,\ncontext-aware answers from a custom-built knowledge base of collected agricultural documents.\n• Architected and populated a vector database with Chroma DB, creating a specialized agricultural corpus; leveraged\nthe BAAI embedding model for semantic search and integrated the OpenRouter LLM API via a Python backend to\ndeliver precise, sourced answers.\nResume Analyser AI – React, Tailwind CSS, Python, Vite\n• Developed an AI-powered web application that evaluates resumes, calculates ATS scores, and compares them with\njob descriptions using LLM integration to deliver detailed insights and improvement suggestions.\n• Built a responsive, cross-browser compatible, and user-friendly interface supporting multiple formats (PDF, DOCX,\ntext) with real-time analysis in under 30 seconds.\nQuickRead AI – React, TypeScript, Tailwind CSS, Python, Vite\n• Developed an AI-powered document assistant enabling users to upload various file types (PDF, Word, Excel, Text,\nZIP) and interact with their content through a natural language chat interface.\n• Integrated LLM-based analysis for real-time, context-aware answers; designed a fully responsive, cross-browser\ncompatible UI with adjustable response creativity.\nTECHNICAL SKILLS\nFrontend:HTML, CSS, JavaScript, React.js, TypeScript, Redux, REST APIs\nProgramming & Other Tools:Python, Git & GitHub, Render, Netlify\nDatabase:SQL\nCERTIFICATIONS\n• HTML CSS And Javascript – Infosys Springboard\n• Python Programming – Campus Connection\n",
  "format": "pdf"
}